{
   "description" : "[h1][b]This mod adds an electromagnet.[/b][/h1]\nWhen powered, it attracts other powered electromagnets. It's strength increases exponentially when the distance to the other electromagnet decreases.\n\nIf you have problems with magnets shooting in all directions, try to add more weight to them!\n\n[b]NOTE: This only works in the test branch! (0.3.0)[/b]\n\n[b]UPDATE 1:[/b]\n[list]\n[*] The strength of an electromagnet can now be changed by powering it using an engine.\n  This makes it easier to attract objects with a lower mass.\n\n[*] Added a polarity.\n  The magnets now has 3 modes, which you can cycle through by pressing [E].\n    - The mode with the magnet symbol attracts all other electromagnets.\n    - The north mode with the 'N' symbol attracts all other electromagnets with a 'S' symbol, and repels all other electromagnets with a 'N' symbol.\n    - The south mode with the 'S' symbol attracts all other electromagnets with a 'N' symbol, and repels all other electromagnets with a 'S' symbol.\n\n[*] Updated the icon to match the part.\n[/list]\n\n[b]UPDATE 2:[/b]\n[list]\n[*] The visuals should now work for multiplayer. (Although I haven't tested this)\n[/list]\n\n[b]UPDATE 3:[/b]\n[list]\n[*] Changed the physicsMaterial to reduce particles. (Thanks to kAN Gaming for showing me this)\n[*] When a magnet is connected to a Driver's Seat, it is powered when you enter the seat.\n[*] Updated the script to now work with Build 374. (7th July, 2018)\n[/list]\n\n[b]UPDATE 4:[/b]\n[list]\n[*] Updated the script to now work with 0.4.0 (backwards compatible with at least 0.3.5)\n[*] Did some optimisations.\n[/list]\n\n[b]TODO:[/b]\n[list]\n[*][strike] Add engine sounds when the electromagnets are powered by engines.[/strike]\n[*] Output some signal (I don't know what yet) to make it easier to let things hover.\n[*] Reduce collision sounds.\n[*][strike] Update the icon to match the part.[/strike]\n[*][strike] Add a polarity. (I am not able to save the polarity at the moment)[/strike]\n[*][strike] Allow an engine to power the electromagnets.[/strike]\n[/list]\n\nThanks to ",
   "fileId" : 1394654240,
   "localId" : "57449221-a932-4e5d-8cd1-0ae05fe0b228",
   "name" : "Electromagnets",
   "type" : "Blocks and Parts",
   "version" : 0
}
